transports_cxf_src_test_java_org_mule_transport_cxf_issues_LargeProxyTestCase.java/[CN]/LargeProxyTestCase/[MT]/testLargeMessageWithEchoProxy()/body

{
  int length=5000;
  MuleClient client=new MuleClient();
  StringBuffer b=new StringBuffer();
  int counter=1;
  while (b.length() < length) {
    b.append(counter).append(" ");
    counter++;
  }
  String largeString=b.toString().trim();
  String msg="<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" " + "xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" " + "xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">"+ "<soap:Body>"+ "<echo xmlns=\"http://simple.component.mule.org/\">"+ "<echo>" + largeString + "</echo>"+ "</echo>"+ "</soap:Body>"+ "</soap:Envelope>";
  MuleMessage result=client.send("http://localhost:63082/services/EchoProxy",msg,null);
  String payloadAsStr=result.getPayloadAsString();
  assertTrue("The payload length should never be 0",payloadAsStr.length() != 0);
  assertTrue(payloadAsStr.indexOf(largeString) != -1);
}
